In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Read The dataset

In [3]:
dataset = pd.read_csv("D:\sandhya\Sandhya\Data-Science\csv\Social_Network_Ads_1.csv")

In [4]:
dataset

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

In [5]:
dataset.shape

(403, 7)

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 403 entries, 0 to 402
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          403 non-null    int64
 1   Date             403 non-null    object
 2   Country          403 non-null    object
 3   Gender           403 non-null    object
 4   Age              403 non-null    int64
 5   EstimatedSalary  401 non-null    float64
 6   Purchased        403 non-null    int64
dtypes: float64(1), int64(3), object(3)
memory usage: 22.2+ KB

In [7]:
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [8]:
dataset.describe()

          User ID    Age  EstimatedSalary  Purchased
count      403.00 403.00           401.00     403.00
mean  15691408.63  37.69         82366.58       0.36
std      71533.72  10.48        248671.57       0.48
min   15566689.00  18.00         15000.00       0.00
25%   15626307.50  30.00         43000.00       0.00
50%   15694288.00  37.00         70000.00       0.00
75%   15750195.50  46.00         88000.00       1.00
max   15815236.00  60.00       5000000.00       1.00

# Find the missing Value

In [9]:
dataset.isnull().any()

User ID            False
Date               False
Country            False
Gender             False
Age                False
EstimatedSalary     True
Purchased          False
dtype: bool

In [10]:
dataset.isnull().sum()

User ID            0
Date               0
Country            0
Gender             0
Age                0
EstimatedSalary    2
Purchased          0
dtype: int64

# Handling the Missing Values

Filling missing value with mean or median or mode

In [15]:
dataset.median()

C:\Users\sandh\AppData\Local\Temp\ipykernel_1784\4167803218.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dataset.median()

User ID           15694288.00
Age                     37.00
EstimatedSalary      70000.00
Purchased                0.00
dtype: float64

In [ ]:
dataset.fillna(dataset.median() , inplace=True)u7uuuuu